---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidValue
source: html/87253348-299f-b733-a021-be6e8b8f7a38.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.InvalidValue Property

Invalid value.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidValue { get; }
```